window.emoji='😀,😃,😄,😁,😆,🥹,😅,😂,🤣,🥲,☺️,😊,😇,🙂,🙃,😉,😌,😍,🥰,😘,😗,😙,😚,😋,😛,😝,😜,🤪,🤨,🧐,🤓,😎,🥸,🤩,🥳,😏,😒,😞,😔,😟,😕,🙁,☹️,😣,😖,😫,😩,🥺,😢,😭,😤,😠,😡,🤬,🤯,😳,🥵,🥶,😶‍🌫️,😱,😨,😰,😥,😓,🤗,🤔,🫣,🤭,🫢,🫡,🤫,🫠,🤥,😶,🫥,😐,🫤,😑,🫨,😬,🙄,😯,😦,😧,😮,😲,🥱,😴,🤤,😪,😮‍💨,😵,😵‍💫,🤐,🥴,🤢,🤮,🤧,😷,🤒,🤕,🤑,🤠,😈,👿,👹,👺,🤡,💩,👻,💀,☠️,👽,👾,🤖,🎃,😺,😸,😹,😻,😼,😽,🙀,😿,😾,🫶,🤲,👐,🙌,👏,🤝,👍,👎,👊,✊,🤛,🤜,🫷,🫸,🤞,✌️,🫰,🤟,🤘,👌,🤌,🤏,🫳,🫴,👈,👉,👆,👇,☝️,✋,🤚,🖐️,🖖,👋,🤙,🫲,🫱,💪,🦾,🖕,✍️,🙏,🫵,🦶,🦵,🦿,💄,💋,👄,🫦,🦷,👅,👂,🦻,👃,👣,👁️,👀,🫀,🫁,🧠,🗣️,👤,👥,🫂,👶,🧒,👧,👦,🧑,👩,👨,🧑‍🦱,👩‍🦱,👨‍🦱,🧑‍🦰,👩‍🦰,👨‍🦰,👱,👱‍♀️,👱‍♂️,🧑‍🦳,👩‍🦳,👨‍🦳,🧑‍🦲,👩‍🦲,👨‍🦲,🧔,🧔‍♀️,🧔‍♂️,🧓,👵,👴,👲,👳,👳‍♀️,👳‍♂️,🧕,👮,👮‍♀️,👮‍♂️,👷,👷‍♀️,👷‍♂️,💂,💂‍♀️,💂‍♂️,🕵️,🕵️‍♀️,🕵️‍♂️,🧑‍⚕️,👩‍⚕️,👨‍⚕️,🧑‍🌾,👩‍🌾,👨‍🌾,🧑‍🍳,👩‍🍳,👨‍🍳,🧑‍🎓,👩‍🎓,👨‍🎓,🧑‍🎤,👩‍🎤,👨‍🎤,🧑‍🏫,👩‍🏫,👨‍🏫,🧑‍🏭,👩‍🏭,👨‍🏭,🧑‍💻,👩‍💻,👨‍💻,🧑‍💼,👩‍💼,👨‍💼,🧑‍🔧,👩‍🔧,👨‍🔧,🧑‍🔬,👩‍🔬,👨‍🔬,🧑‍🎨,👩‍🎨,👨‍🎨,🧑‍🚒,👩‍🚒,👨‍🚒,🧑‍✈️,👩‍✈️,👨‍✈️,🧑‍🚀,👩‍🚀,👨‍🚀,🧑‍⚖️,👩‍⚖️,👨‍⚖️,👰,👰‍♀️,👰‍♂️,🤵,🤵‍♀️,🤵‍♂️,🫅,👸,🤴,🦸,🦸‍♀️,🦸‍♂️,🦹,🦹‍♀️,🦹‍♂️,🥷,🧑‍🎄,🤶,🎅,🧙,🧙‍♀️,🧙‍♂️,🧝,🧝‍♀️,🧝‍♂️,🧌,🧛,🧛‍♀️,🧛‍♂️,🧟,🧟‍♀️,🧟‍♂️,🧞,🧞‍♀️,🧞‍♂️,🧜,🧜‍♀️,🧜‍♂️,🧚,🧚‍♀️,🧚‍♂️,👼,🫄,🤰,🫃,🤱,🧑‍🍼,👩‍🍼,👨‍🍼,🙇,🙇‍♀️,🙇‍♂️,💁,💁‍♀️,💁‍♂️,🙅,🙅‍♀️,🙅‍♂️,🙆,🙆‍♀️,🙆‍♂️,🙋,🙋‍♀️,🙋‍♂️,🧏,🧏‍♀️,🧏‍♂️,🤦,🤦‍♀️,🤦‍♂️,🤷,🤷‍♀️,🤷‍♂️,🙎,🙎‍♀️,🙎‍♂️,🙍,🙍‍♀️,🙍‍♂️,💇,💇‍♀️,💇‍♂️,💆,💆‍♀️,💆‍♂️,🧖,🧖‍♀️,🧖‍♂️,💅,🤳,💃,🕺,👯,👯‍♀️,👯‍♂️,🕴️,🧑‍🦽,👩‍🦽,👨‍🦽,🧑‍🦼,👩‍🦼,👨‍🦼,🚶,🚶‍♀️,🚶‍♂️,🧑‍🦯,👩‍🦯,👨‍🦯,🧎,🧎‍♀️,🧎‍♂️,🏃,🏃‍♀️,🏃‍♂️,🧍,🧍‍♀️,🧍‍♂️,🧑‍🤝‍🧑,👫,👭,👬,💑,👩‍❤️‍👨,👩‍❤️‍👩,👨‍❤️‍👨,💏,👩‍❤️‍💋‍👨,👩‍❤️‍💋‍👩,👨‍❤️‍💋‍👨,👪,👨‍👩‍👦,👨‍👩‍👧,👨‍👩‍👧‍👦,👨‍👩‍👦‍👦,👨‍👩‍👧‍👧,👩‍👩‍👦,👩‍👩‍👧,👩‍👩‍👧‍👦,👩‍👩‍👦‍👦,👩‍👩‍👧‍👧,👨‍👨‍👦,👨‍👨‍👧,👨‍👨‍👧‍👦,👨‍👨‍👦‍👦,👨‍👨‍👧‍👧,👩‍👦,👩‍👧,👩‍👧‍👦,👩‍👦‍👦,👩‍👧‍👧,👨‍👦,👨‍👧,👨‍👧‍👦,👨‍👦‍👦,👨‍👧‍👧,🪢,🧶,🧵,🪡,🧥,🥼,🦺,👚,👕,👖,🩲,🩳,👔,👗,👙,🩱,👘,🥻,🩴,🥿,👠,👡,👢,👞,👟,🥾,🧦,🧤,🧣,🎩,🧢,👒,🎓,⛑️,🪖,👑,💍,👝,👛,👜,💼,🎒,🧳,👓,🕶️,🥽,🌂,🐶,🐱,🐭,🐹,🐰,🦊,🐻,🐼,🐻‍❄️,🐨,🐯,🦁,🐮,🐷,🐽,🐸,🐵,🙈,🙉,🙊,🐒,🐔,🐧,🐦,🐤,🐣,🐥,🪿,🦆,🐦‍⬛,🦅,🦉,🦇,🐺,🐗,🐴,🦄,🫎,🐝,🪱,🐛,🦋,🐌,🐞,🐜,🪰,🪲,🪳,🦟,🦗,🕷️,🕸️,🦂,🐢,🐍,🦎,🦖,🦕,🐙,🦑,🪼,🦐,🦞,🦀,🐡,🐠,🐟,🐬,🐳,🐋,🦈,🦭,🐊,🐅,🐆,🦓,🦍,🦧,🦣,🐘,🦛,🦏,🐪,🐫,🦒,🦘,🦬,🐃,🐂,🐄,🫏,🐎,🐖,🐏,🐑,🦙,🐐,🦌,🐕,🐩,🦮,🐕‍🦺,🐈,🐈‍⬛,🪶,🪽,🐓,🦃,🦤,🦚,🦜,🦢,🦩,🕊️,🐇,🦝,🦨,🦡,🦫,🦦,🦥,🐁,🐀,🐿️,🦔,🐾,🐉,🐲,🌵,🎄,🌲,🌳,🌴,🪵,🌱,🌿,☘️,🍀,🎍,🪴,🎋,🍃,🍂,🍁,🪺,🪹,🍄,🐚,🪸,🪨,🌾,💐,🌷,🌹,🥀,🪻,🪷,🌺,🌸,🌼,🌻,🌞,🌝,🌛,🌜,🌚,🌕,🌖,🌗,🌘,🌑,🌒,🌓,🌔,🌙,🌎,🌍,🌏,🪐,💫,⭐,🌟,✨,⚡,☄️,💥,🔥,🌪️,🌈,☀️,🌤️,⛅,🌥️,☁️,🌦️,🌧️,⛈️,🌩️,🌨️,❄️,☃️,⛄,🌬️,💨,💧,💦,🫧,☔,☂️,🌊,🌫️,🍏,🍎,🍐,🍊,🍋,🍌,🍉,🍇,🍓,🫐,🍈,🍒,🍑,🥭,🍍,🥥,🥝,🍅,🍆,🥑,🫛,🥦,🥬,🥒,🌶️,🫑,🌽,🥕,🫒,🧄,🧅,🥔,🍠,🫚,🥐,🥯,🍞,🥖,🥨,🧀,🥚,🍳,🧈,🥞,🧇,🥓,🥩,🍗,🍖,🦴,🌭,🍔,🍟,🍕,🫓,🥪,🥙,🧆,🌮,🌯,🫔,🥗,🥘,🫕,🥫,🫙,🍝,🍜,🍲,🍛,🍣,🍱,🥟,🦪,🍤,🍙,🍚,🍘,🍥,🥠,🥮,🍢,🍡,🍧,🍨,🍦,🥧,🧁,🍰,🎂,🍮,🍭,🍬,🍫,🍿,🍩,🍪,🌰,🥜,🫘,🍯,🥛,🫗,🍼,🫖,☕,🍵,🧉,🧃,🥤,🧋,🍶,🍺,🍻,🥂,🍷,🥃,🍸,🍹,🍾,🧊,🥄,🍴,🍽️,🥣,🥡,🥢,🧂,⚽,🏀,🏈,⚾,🥎,🎾,🏐,🏉,🥏,🎱,🪀,🏓,🏸,🏒,🏑,🥍,🏏,🪃,🥅,⛳,🪁,🛝,🏹,🎣,🤿,🥊,🥋,🎽,🛹,🛼,🛷,⛸️,🥌,🎿,⛷️,🏂,🪂,🏋️,🏋️‍♀️,🏋️‍♂️,🤼,🤼‍♀️,🤼‍♂️,🤸,🤸‍♀️,🤸‍♂️,⛹️,⛹️‍♀️,⛹️‍♂️,🤺,🤾,🤾‍♀️,🤾‍♂️,🏌️,🏌️‍♀️,🏌️‍♂️,🏇,🧘,🧘‍♀️,🧘‍♂️,🏄,🏄‍♀️,🏄‍♂️,🏊,🏊‍♀️,🏊‍♂️,🤽,🤽‍♀️,🤽‍♂️,🚣,🚣‍♀️,🚣‍♂️,🧗,🧗‍♀️,🧗‍♂️,🚵,🚵‍♀️,🚵‍♂️,🚴,🚴‍♀️,🚴‍♂️,🏆,🥇,🥈,🥉,🏅,🎖️,🏵️,🎗️,🎫,🎟️,🎪,🤹,🤹‍♀️,🤹‍♂️,🎭,🩰,🎨,🎬,🎤,🎧,🎼,🎹,🪇,🥁,🪘,🎷,🎺,🪗,🎸,🪕,🎻,🪈,🎲,♟️,🎯,🎳,🎮,🎰,🧩,🚗,🚕,🚙,🛻,🚐,🚌,🚎,🏎️,🚓,🚑,🚒,🚚,🚛,🚜,🦯,🦽,🦼,🩼,🛴,🚲,🛵,🏍️,🛺,🛞,🚨,🚔,🚍,🚘,🚖,🚡,🚠,🚟,🚃,🚋,🚞,🚝,🚄,🚅,🚈,🚂,🚆,🚇,🚊,🚉,✈️,🛫,🛬,🛩️,💺,🛰️,🚀,🛸,🚁,🛶,⛵,🚤,🛥️,🛳️,⛴️,🚢,🛟,⚓,🪝,⛽,🚧,🚦,🚥,🚏,🗺️,🗿,🗽,🗼,🏰,🏯,🏟️,🎡,🎢,🎠,⛲,⛱️,🏖️,🏝️,🏜️,🌋,⛰️,🏔️,🗻,🏕️,⛺,🏠,🏡,🏘️,🏚️,🛖,🏗️,🏭,🏢,🏬,🏣,🏤,🏥,🏦,🏨,🏪,🏫,🏩,💒,🏛️,⛪,🕌,🕍,🛕,🕋,⛩️,🛤️,🛣️,🗾,🎑,🏞️,🌅,🌄,🌠,🎇,🎆,🌇,🌆,🏙️,🌃,🌌,🌉,🌁,⌚,📱,📲,💻,⌨️,🖥️,🖨️,🖱️,🖲️,🕹️,🗜️,💽,💾,💿,📀,📼,📷,📸,📹,🎥,📽️,🎞️,📞,☎️,📟,📠,📺,📻,🎙️,🎚️,🎛️,🧭,⏱️,⏲️,⏰,🕰️,⌛,⏳,📡,🔋,🪫,🔌,💡,🔦,🕯️,🪔,🧯,🛢️,💸,💵,💴,💶,💷,🪙,💰,💳,🪪,💎,⚖️,🪜,🧰,🪛,🔧,🔨,⚒️,🛠️,⛏️,🪚,🔩,⚙️,🪤,🧱,⛓️,🧲,🔫,💣,🧨,🪓,🔪,🗡️,⚔️,🛡️,🚬,⚰️,🪦,⚱️,🏺,🔮,📿,🧿,🪬,💈,⚗️,🔭,🔬,🕳️,🩻,🩹,🩺,💊,💉,🩸,🧬,🦠,🧫,🧪,🌡️,🧹,🪠,🧺,🧻,🚽,🚰,🚿,🛁,🛀,🧼,🪥,🪒,🪮,🧽,🪣,🧴,🛎️,🔑,🗝️,🚪,🪑,🛋️,🛏️,🛌,🧸,🪆,🖼️,🪞,🪟,🛍️,🛒,🎁,🎈,🎏,🎀,🪄,🪅,🎊,🎉,🎎,🪭,🏮,🎐,🪩,🧧,✉️,📩,📨,📧,💌,📥,📤,📦,🏷️,🪧,📪,📫,📬,📭,📮,📯,📜,📃,📄,📑,🧾,📊,📈,📉,🗒️,🗓️,📆,📅,🗑️,📇,🗃️,🗳️,🗄️,📋,📁,📂,🗂️,🗞️,📰,📓,📔,📒,📕,📗,📘,📙,📚,📖,🔖,🧷,🔗,📎,🖇️,📐,📏,🧮,📌,📍,✂️,🖊️,🖋️,✒️,🖌️,🖍️,📝,✏️,🔍,🔎,🔏,🔐,🔒,🔓,🩷,❤️,🧡,💛,💚,🩵,💙,💜,🖤,🩶,🤍,🤎,💔,❣️,💕,💞,💓,💗,💖,💘,💝,❤️‍🩹,❤️‍🔥,💟,☮️,✝️,☪️,🕉️,☸️,🪯,✡️,🔯,🕎,☯️,☦️,🛐,⛎,♈,♉,♊,♋,♌,♍,♎,♏,♐,♑,♒,♓,🆔,⚛️,🉑,☢️,☣️,📴,📳,🈶,🈚,🈸,🈺,🈷️,✴️,🆚,💮,🉐,㊙️,㊗️,🈴,🈵,🈹,🈲,🅰️,🅱️,🆎,🆑,🅾️,🆘,❌,⭕,🛑,⛔,📛,🚫,💯,💢,♨️,🚷,🚯,🚳,🚱,🔞,📵,🚭,❗,❕,❓,❔,‼️,⁉️,🔅,🔆,〽️,⚠️,🚸,🔱,⚜️,🔰,♻️,✅,🈯,💹,❇️,✳️,❎,🌐,💠,Ⓜ️,🌀,💤,🏧,🚾,♿,🅿️,🛗,🈳,🈂️,🛂,🛃,🛄,🛅,🛜,🚹,🚺,🚼,🚻,🚮,🎦,📶,🈁,🔣,ℹ️,🔤,🔡,🔠,🆖,🆗,🆙,🆒,🆕,🆓,0️⃣,1️⃣,2️⃣,3️⃣,4️⃣,5️⃣,6️⃣,7️⃣,8️⃣,9️⃣,🔟,🔢,#️⃣,*️⃣,⏏️,▶️,⏸️,⏯️,⏹️,⏺️,⏭️,⏮️,⏩,⏪,⏫,⏬,◀️,🔼,🔽,➡️,⬅️,⬆️,⬇️,↗️,↘️,↙️,↖️,↕️,↔️,↪️,↩️,⤴️,⤵️,🔀,🔁,🔂,🔄,🔃,🎵,🎶,➕,➖,➗,✖️,🟰,♾️,💲,💱,™️,©️,®️,〰️,➰,➿,🔚,🔙,🔛,🔝,🔜,✔️,☑️,🔘,⚪,⚫,🔴,🔵,🟤,🟣,🟢,🟡,🟠,🔺,🔻,🔸,🔹,🔶,🔷,🔳,🔲,▪️,▫️,◾,◽,◼️,◻️,⬛,⬜,🟧,🟦,🟥,🟫,🟪,🟩,🟨,🔈,🔇,🔉,🔊,🔔,🔕,📣,📢,🗨️,👁️‍🗨️,💬,💭,🗯️,♠️,♣️,♥️,♦️,🃏,🎴,🀄,🕐,🕑,🕒,🕓,🕔,🕕,🕖,🕗,🕘,🕙,🕚,🕛,🕜,🕝,🕞,🕟,🕠,🕡,🕢,🕣,🕤,🕥,🕦,🕧,0️,1️,2️,3️,4️,5️,6️,7️,8️,9️,#️,*️,♀️,♂️,⚧,⚕️,🏳️,🏴,🏴‍☠️,🏁,🚩,🏳️‍🌈,🏳️‍⚧️,🇺🇳,🇦🇫,🇦🇽,🇦🇱,🇩🇿,🇦🇸,🇦🇩,🇦🇴,🇦🇮,🇦🇶,🇦🇬,🇦🇷,🇦🇲,🇦🇼,🇦🇺,🇦🇹,🇦🇿,🇧🇸,🇧🇭,🇧🇩,🇧🇧,🇧🇾,🇧🇪,🇧🇿,🇧🇯,🇧🇲,🇧🇹,🇧🇴,🇧🇦,🇧🇼,🇧🇷,🇮🇴,🇻🇬,🇧🇳,🇧🇬,🇧🇫,🇧🇮,🇰🇭,🇨🇲,🇨🇦,🇮🇨,🇨🇻,🇧🇶,🇰🇾,🇨🇫,🇹🇩,🇨🇱,🇨🇳,🇨🇽,🇨🇨,🇨🇴,🇰🇲,🇨🇬,🇨🇩,🇨🇰,🇨🇷,🇨🇮,🇭🇷,🇨🇺,🇨🇼,🇨🇾,🇨🇿,🇩🇰,🇩🇯,🇩🇲,🇩🇴,🇪🇨,🇪🇬,🇸🇻,🇬🇶,🇪🇷,🇪🇪,🇪🇹,🇪🇺,🇫🇰,🇫🇴,🇫🇯,🇫🇮,🇫🇷,🇬🇫,🇵🇫,🇹🇫,🇬🇦,🇬🇲,🇬🇪,🇩🇪,🇬🇭,🇬🇮,🇬🇷,🇬🇱,🇬🇩,🇬🇵,🇬🇺,🇬🇹,🇬🇬,🇬🇳,🇬🇼,🇬🇾,🇭🇹,🇭🇳,🇭🇰,🇭🇺,🇮🇸,🇮🇳,🇮🇩,🇮🇷,🇮🇶,🇮🇪,🇮🇲,🇮🇱,🇮🇹,🇯🇲,🇯🇵,🎌,🇯🇪,🇯🇴,🇰🇿,🇰🇪,🇰🇮,🇽🇰,🇰🇼,🇰🇬,🇱🇦,🇱🇻,🇱🇧,🇱🇸,🇱🇷,🇱🇾,🇱🇮,🇱🇹,🇱🇺,🇲🇴,🇲🇰,🇲🇬,🇲🇼,🇲🇾,🇲🇻,🇲🇱,🇲🇹,🇲🇭,🇲🇶,🇲🇷,🇲🇺,🇾🇹,🇲🇽,🇫🇲,🇲🇩,🇲🇨,🇲🇳,🇲🇪,🇲🇸,🇲🇦,🇲🇿,🇲🇲,🇳🇦,🇳🇷,🇳🇵,🇳🇱,🇳🇨,🇳🇿,🇳🇮,🇳🇪,🇳🇬,🇳🇺,🇳🇫,🇰🇵,🇲🇵,🇳🇴,🇴🇲,🇵🇰,🇵🇼,🇵🇸,🇵🇦,🇵🇬,🇵🇾,🇵🇪,🇵🇭,🇵🇳,🇵🇱,🇵🇹,🇵🇷,🇶🇦,🇷🇪,🇷🇴,🇷🇺,🇷🇼,🇼🇸,🇸🇲,🇸🇹,🇸🇦,🇸🇳,🇷🇸,🇸🇨,🇸🇱,🇸🇬,🇸🇽,🇸🇰,🇸🇮,🇬🇸,🇸🇧,🇸🇴,🇿🇦,🇰🇷,🇸🇸,🇪🇸,🇱🇰,🇧🇱,🇸🇭,🇰🇳,🇱🇨,🇵🇲,🇻🇨,🇸🇩,🇸🇷,🇸🇿,🇸🇪,🇨🇭,🇸🇾,🇹🇼,🇹🇯,🇹🇿,🇹🇭,🇹🇱,🇹🇬,🇹🇰,🇹🇴,🇹🇹,🇹🇳,🇹🇷,🇹🇲,🇹🇨,🇻🇮,🇹🇻,🇺🇬,🇺🇦,🇦🇪,🇬🇧,🏴󠁧󠁢󠁥󠁮󠁧󠁿,🏴󠁧󠁢󠁳󠁣󠁴󠁿,🏴󠁧󠁢󠁷󠁬󠁳󠁿,🇺🇸,🇺🇾,🇺🇿,🇻🇺,🇻🇦,🇻🇪,🇻🇳,🇼🇫,🇪🇭,🇾🇪,🇿🇲,🇿🇼,🇦🇨,🇧🇻,🇨🇵,🇪🇦,🇩🇬,🇭🇲,🇲🇫,🇸🇯,🇹🇦,🇺🇲,🫶🏻,🫶🏼,🫶🏽,🫶🏾,🫶🏿,🤲🏻,🤲🏼,🤲🏽,🤲🏾,🤲🏿,👐🏻,👐🏼,👐🏽,👐🏾,👐🏿,🙌🏻,🙌🏼,🙌🏽,🙌🏾,🙌🏿,👏🏻,👏🏼,👏🏽,👏🏾,👏🏿,🤝🏻,🫱🏻‍🫲🏼,🫱🏻‍🫲🏽,🫱🏻‍🫲🏾,🫱🏻‍🫲🏿,🫱🏼‍🫲🏻,🤝🏼,🫱🏼‍🫲🏽,🫱🏼‍🫲🏾,🫱🏼‍🫲🏿,🫱🏽‍🫲🏻,🫱🏽‍🫲🏼,🤝🏽,🫱🏽‍🫲🏾,🫱🏽‍🫲🏿,🫱🏾‍🫲🏻,🫱🏾‍🫲🏼,🫱🏾‍🫲🏽,🤝🏾,🫱🏾‍🫲🏿,🫱🏿‍🫲🏻,🫱🏿‍🫲🏼,🫱🏿‍🫲🏽,🫱🏿‍🫲🏾,🤝🏿,👍🏻,👍🏼,👍🏽,👍🏾,👍🏿,👎🏻,👎🏼,👎🏽,👎🏾,👎🏿,👊🏻,👊🏼,👊🏽,👊🏾,👊🏿,✊🏻,✊🏼,✊🏽,✊🏾,✊🏿,🤛🏻,🤛🏼,🤛🏽,🤛🏾,🤛🏿,🤜🏻,🤜🏼,🤜🏽,🤜🏾,🤜🏿,🫷🏻,🫷🏼,🫷🏽,🫷🏾,🫷🏿,🫸🏻,🫸🏼,🫸🏽,🫸🏾,🫸🏿,🤞🏻,🤞🏼,🤞🏽,🤞🏾,🤞🏿,✌🏻,✌🏼,✌🏽,✌🏾,✌🏿,🫰🏻,🫰🏼,🫰🏽,🫰🏾,🫰🏿,🤟🏻,🤟🏼,🤟🏽,🤟🏾,🤟🏿,🤘🏻,🤘🏼,🤘🏽,🤘🏾,🤘🏿,👌🏻,👌🏼,👌🏽,👌🏾,👌🏿,🤌🏼,🤌🏻,🤌🏽,🤌🏾,🤌🏿,🤏🏻,🤏🏼,🤏🏽,🤏🏾,🤏🏿,🫳🏻,🫳🏼,🫳🏽,🫳🏾,🫳🏿,🫴🏻,🫴🏼,🫴🏽,🫴🏾,🫴🏿,👈🏻,👈🏼,👈🏽,👈🏾,👈🏿,👉🏻,👉🏼,👉🏽,👉🏾,👉🏿,👆🏻,👆🏼,👆🏽,👆🏾,👆🏿,👇🏻,👇🏼,👇🏽,👇🏾,👇🏿,☝🏻,☝🏼,☝🏽,☝🏾,☝🏿,✋🏻,✋🏼,✋🏽,✋🏾,✋🏿,🤚🏻,🤚🏼,🤚🏽,🤚🏾,🤚🏿,🖐🏻,🖐🏼,🖐🏽,🖐🏾,🖐🏿,🖖🏻,🖖🏼,🖖🏽,🖖🏾,🖖🏿,👋🏻,👋🏼,👋🏽,👋🏾,👋🏿,🤙🏻,🤙🏼,🤙🏽,🤙🏾,🤙🏿,🫲🏻,🫲🏼,🫲🏽,🫲🏾,🫲🏿,🫱🏻,🫱🏼,🫱🏽,🫱🏾,🫱🏿,💪🏻,💪🏼,💪🏽,💪🏾,💪🏿,🖕🏻,🖕🏼,🖕🏽,🖕🏾,🖕🏿,✍🏻,✍🏼,✍🏽,✍🏾,✍🏿,🙏🏻,🙏🏼,🙏🏽,🙏🏾,🙏🏿,🫵🏻,🫵🏼,🫵🏽,🫵🏾,🫵🏿,🦶🏻,🦶🏼,🦶🏽,🦶🏾,🦶🏿,🦵🏻,🦵🏼,🦵🏽,🦵🏾,🦵🏿,👂🏻,👂🏼,👂🏽,👂🏾,👂🏿,🦻🏻,🦻🏼,🦻🏽,🦻🏾,🦻🏿,👃🏻,👃🏼,👃🏽,👃🏾,👃🏿,👶🏻,👶🏼,👶🏽,👶🏾,👶🏿,🧒🏻,🧒🏼,🧒🏽,🧒🏾,🧒🏿,👧🏻,👧🏼,👧🏽,👧🏾,👧🏿,👦🏻,👦🏼,👦🏽,👦🏾,👦🏿,🧑🏻,🧑🏼,🧑🏽,🧑🏾,🧑🏿,👩🏻,👩🏼,👩🏽,👩🏾,👩🏿,👨🏻,👨🏼,👨🏽,👨🏾,👨🏿,🧑🏻‍🦱,🧑🏼‍🦱,🧑🏽‍🦱,🧑🏾‍🦱,🧑🏿‍🦱,👩🏻‍🦱,👩🏼‍🦱,👩🏽‍🦱,👩🏾‍🦱,👩🏿‍🦱,👨🏻‍🦱,👨🏼‍🦱,👨🏽‍🦱,👨🏾‍🦱,👨🏿‍🦱,🧑🏻‍🦰,🧑🏼‍🦰,🧑🏽‍🦰,🧑🏾‍🦰,🧑🏿‍🦰,👩🏻‍🦰,👩🏼‍🦰,👩🏽‍🦰,👩🏾‍🦰,👩🏿‍🦰,👨🏻‍🦰,👨🏼‍🦰,👨🏽‍🦰,👨🏾‍🦰,👨🏿‍🦰,👱🏻,👱🏼,👱🏽,👱🏾,👱🏿,👱🏻‍♀️,👱🏼‍♀️,👱🏽‍♀️,👱🏾‍♀️,👱🏿‍♀️,👱🏻‍♂️,👱🏼‍♂️,👱🏽‍♂️,👱🏾‍♂️,👱🏿‍♂️,🧑🏻‍🦳,🧑🏼‍🦳,🧑🏽‍🦳,🧑🏾‍🦳,🧑🏿‍🦳,👩🏻‍🦳,👩🏼‍🦳,👩🏽‍🦳,👩🏾‍🦳,👩🏿‍🦳,👨🏻‍🦳,👨🏼‍🦳,👨🏽‍🦳,👨🏾‍🦳,👨🏿‍🦳,🧑🏻‍🦲,🧑🏼‍🦲,🧑🏽‍🦲,🧑🏾‍🦲,🧑🏿‍🦲,👩🏻‍🦲,👩🏼‍🦲,👩🏽‍🦲,👩🏾‍🦲,👩🏿‍🦲,👨🏻‍🦲,👨🏼‍🦲,👨🏽‍🦲,👨🏾‍🦲,👨🏿‍🦲,🧔🏻,🧔🏼,🧔🏽,🧔🏾,🧔🏿,🧔🏻‍♀️,🧔🏼‍♀️,🧔🏽‍♀️,🧔🏾‍♀️,🧔🏿‍♀️,🧔🏻‍♂️,🧔🏼‍♂️,🧔🏽‍♂️,🧔🏾‍♂️,🧔🏿‍♂️,🧓🏻,🧓🏼,🧓🏽,🧓🏾,🧓🏿,👵🏻,👵🏼,👵🏽,👵🏾,👵🏿,👴🏻,👴🏼,👴🏽,👴🏾,👴🏿,👲🏻,👲🏼,👲🏽,👲🏾,👲🏿,👳🏻,👳🏼,👳🏽,👳🏾,👳🏿,👳🏻‍♀️,👳🏼‍♀️,👳🏽‍♀️,👳🏾‍♀️,👳🏿‍♀️,👳🏻‍♂️,👳🏼‍♂️,👳🏽‍♂️,👳🏾‍♂️,👳🏿‍♂️,🧕🏻,🧕🏼,🧕🏽,🧕🏾,🧕🏿,👮🏻,👮🏼,👮🏽,👮🏾,👮🏿,👮🏻‍♀️,👮🏼‍♀️,👮🏽‍♀️,👮🏾‍♀️,👮🏿‍♀️,👮🏻‍♂️,👮🏼‍♂️,👮🏽‍♂️,👮🏾‍♂️,👮🏿‍♂️,👷🏻,👷🏼,👷🏽,👷🏾,👷🏿,👷🏻‍♀️,👷🏼‍♀️,👷🏽‍♀️,👷🏾‍♀️,👷🏿‍♀️,👷🏻‍♂️,👷🏼‍♂️,👷🏽‍♂️,👷🏾‍♂️,👷🏿‍♂️,💂🏻,💂🏼,💂🏽,💂🏾,💂🏿,💂🏻‍♀️,💂🏼‍♀️,💂🏽‍♀️,💂🏾‍♀️,💂🏿‍♀️,💂🏻‍♂️,💂🏼‍♂️,💂🏽‍♂️,💂🏾‍♂️,💂🏿‍♂️,🕵🏻,🕵🏼,🕵🏽,🕵🏾,🕵🏿,🕵🏻‍♀️,🕵🏼‍♀️,🕵🏽‍♀️,🕵🏾‍♀️,🕵🏿‍♀️,🕵🏻‍♂️,🕵🏼‍♂️,🕵🏽‍♂️,🕵🏾‍♂️,🕵🏿‍♂️,🧑🏻‍⚕️,🧑🏼‍⚕️,🧑🏽‍⚕️,🧑🏾‍⚕️,🧑🏿‍⚕️,👩🏻‍⚕️,👩🏼‍⚕️,👩🏽‍⚕️,👩🏾‍⚕️,👩🏿‍⚕️,👨🏻‍⚕️,👨🏼‍⚕️,👨🏽‍⚕️,👨🏾‍⚕️,👨🏿‍⚕️,🧑🏻‍🌾,🧑🏼‍🌾,🧑🏽‍🌾,🧑🏾‍🌾,🧑🏿‍🌾,👩🏻‍🌾,👩🏼‍🌾,👩🏽‍🌾,👩🏾‍🌾,👩🏿‍🌾,👨🏻‍🌾,👨🏼‍🌾,👨🏽‍🌾,👨🏾‍🌾,👨🏿‍🌾,🧑🏻‍🍳,🧑🏼‍🍳,🧑🏽‍🍳,🧑🏾‍🍳,🧑🏿‍🍳,👩🏻‍🍳,👩🏼‍🍳,👩🏽‍🍳,👩🏾‍🍳,👩🏿‍🍳,👨🏻‍🍳,👨🏼‍🍳,👨🏽‍🍳,👨🏾‍🍳,👨🏿‍🍳,🧑🏻‍🎓,🧑🏼‍🎓,🧑🏽‍🎓,🧑🏾‍🎓,🧑🏿‍🎓,👩🏻‍🎓,👩🏼‍🎓,👩🏽‍🎓,👩🏾‍🎓,👩🏿‍🎓,👨🏻‍🎓,👨🏼‍🎓,👨🏽‍🎓,👨🏾‍🎓,👨🏿‍🎓,🧑🏻‍🎤,🧑🏼‍🎤,🧑🏽‍🎤,🧑🏾‍🎤,🧑🏿‍🎤,👩🏻‍🎤,👩🏼‍🎤,👩🏽‍🎤,👩🏾‍🎤,👩🏿‍🎤,👨🏻‍🎤,👨🏼‍🎤,👨🏽‍🎤,👨🏾‍🎤,👨🏿‍🎤,🧑🏻‍🏫,🧑🏼‍🏫,🧑🏽‍🏫,🧑🏾‍🏫,🧑🏿‍🏫,👩🏻‍🏫,👩🏼‍🏫,👩🏽‍🏫,👩🏾‍🏫,👩🏿‍🏫,👨🏻‍🏫,👨🏼‍🏫,👨🏽‍🏫,👨🏾‍🏫,👨🏿‍🏫,🧑🏻‍🏭,🧑🏼‍🏭,🧑🏽‍🏭,🧑🏾‍🏭,🧑🏿‍🏭,👩🏻‍🏭,👩🏼‍🏭,👩🏽‍🏭,👩🏾‍🏭,👩🏿‍🏭,👨🏻‍🏭,👨🏼‍🏭,👨🏽‍🏭,👨🏾‍🏭,👨🏿‍🏭,🧑🏻‍💻,🧑🏼‍💻,🧑🏽‍💻,🧑🏾‍💻,🧑🏿‍💻,👩🏻‍💻,👩🏼‍💻,👩🏽‍💻,👩🏾‍💻,👩🏿‍💻,👨🏻‍💻,👨🏼‍💻,👨🏽‍💻,👨🏾‍💻,👨🏿‍💻,🧑🏻‍💼,🧑🏼‍💼,🧑🏽‍💼,🧑🏾‍💼,🧑🏿‍💼,👩🏻‍💼,👩🏼‍💼,👩🏽‍💼,👩🏾‍💼,👩🏿‍💼,👨🏻‍💼,👨🏼‍💼,👨🏽‍💼,👨🏾‍💼,👨🏿‍💼,🧑🏻‍🔧,🧑🏼‍🔧,🧑🏽‍🔧,🧑🏾‍🔧,🧑🏿‍🔧,👩🏻‍🔧,👩🏼‍🔧,👩🏽‍🔧,👩🏾‍🔧,👩🏿‍🔧,👨🏻‍🔧,👨🏼‍🔧,👨🏽‍🔧,👨🏾‍🔧,👨🏿‍🔧,🧑🏻‍🔬,🧑🏼‍🔬,🧑🏽‍🔬,🧑🏾‍🔬,🧑🏿‍🔬,👩🏻‍🔬,👩🏼‍🔬,👩🏽‍🔬,👩🏾‍🔬,👩🏿‍🔬,👨🏻‍🔬,👨🏼‍🔬,👨🏽‍🔬,👨🏾‍🔬,👨🏿‍🔬,🧑🏻‍🎨,🧑🏼‍🎨,🧑🏽‍🎨,🧑🏾‍🎨,🧑🏿‍🎨,👩🏻‍🎨,👩🏼‍🎨,👩🏽‍🎨,👩🏾‍🎨,👩🏿‍🎨,👨🏻‍🎨,👨🏼‍🎨,👨🏽‍🎨,👨🏾‍🎨,👨🏿‍🎨,🧑🏻‍🚒,🧑🏼‍🚒,🧑🏽‍🚒,🧑🏾‍🚒,🧑🏿‍🚒,👩🏻‍🚒,👩🏼‍🚒,👩🏽‍🚒,👩🏾‍🚒,👩🏿‍🚒,👨🏻‍🚒,👨🏼‍🚒,👨🏽‍🚒,👨🏾‍🚒,👨🏿‍🚒,🧑🏻‍✈️,🧑🏼‍✈️,🧑🏽‍✈️,🧑🏾‍✈️,🧑🏿‍✈️,👩🏻‍✈️,👩🏼‍✈️,👩🏽‍✈️,👩🏾‍✈️,👩🏿‍✈️,👨🏻‍✈️,👨🏼‍✈️,👨🏽‍✈️,👨🏾‍✈️,👨🏿‍✈️,🧑🏻‍🚀,🧑🏼‍🚀,🧑🏽‍🚀,🧑🏾‍🚀,🧑🏿‍🚀,👩🏻‍🚀,👩🏼‍🚀,👩🏽‍🚀,👩🏾‍🚀,👩🏿‍🚀,👨🏻‍🚀,👨🏼‍🚀,👨🏽‍🚀,👨🏾‍🚀,👨🏿‍🚀,🧑🏻‍⚖️,🧑🏼‍⚖️,🧑🏽‍⚖️,🧑🏾‍⚖️,🧑🏿‍⚖️,👩🏻‍⚖️,👩🏼‍⚖️,👩🏽‍⚖️,👩🏾‍⚖️,👩🏿‍⚖️,👨🏻‍⚖️,👨🏼‍⚖️,👨🏽‍⚖️,👨🏾‍⚖️,👨🏿‍⚖️,👰🏻,👰🏼,👰🏽,👰🏾,👰🏿,👰🏻‍♀️,👰🏼‍♀️,👰🏽‍♀️,👰🏾‍♀️,👰🏿‍♀️,👰🏻‍♂️,👰🏼‍♂️,👰🏽‍♂️,👰🏾‍♂️,👰🏿‍♂️,🤵🏻,🤵🏼,🤵🏽,🤵🏾,🤵🏿,🤵🏻‍♀️,🤵🏼‍♀️,🤵🏽‍♀️,🤵🏾‍♀️,🤵🏿‍♀️,🤵🏻‍♂️,🤵🏼‍♂️,🤵🏽‍♂️,🤵🏾‍♂️,🤵🏿‍♂️,🫅🏻,🫅🏼,🫅🏽,🫅🏾,🫅🏿,👸🏻,👸🏼,👸🏽,👸🏾,👸🏿,🤴🏻,🤴🏼,🤴🏽,🤴🏾,🤴🏿,🦸🏻,🦸🏼,🦸🏽,🦸🏾,🦸🏿,🦸🏻‍♀️,🦸🏼‍♀️,🦸🏽‍♀️,🦸🏾‍♀️,🦸🏿‍♀️,🦸🏻‍♂️,🦸🏼‍♂️,🦸🏽‍♂️,🦸🏾‍♂️,🦸🏿‍♂️,🦹🏻,🦹🏼,🦹🏽,🦹🏾,🦹🏿,🦹🏻‍♀️,🦹🏼‍♀️,🦹🏽‍♀️,🦹🏾‍♀️,🦹🏿‍♀️,🦹🏻‍♂️,🦹🏼‍♂️,🦹🏽‍♂️,🦹🏾‍♂️,🦹🏿‍♂️,🥷🏻,🥷🏼,🥷🏽,🥷🏾,🥷🏿,🧑🏻‍🎄,🧑🏼‍🎄,🧑🏽‍🎄,🧑🏾‍🎄,🧑🏿‍🎄,🤶🏻,🤶🏼,🤶🏽,🤶🏾,🤶🏿,🎅🏻,🎅🏼,🎅🏽,🎅🏾,🎅🏿,🧙🏻,🧙🏼,🧙🏽,🧙🏾,🧙🏿,🧙🏻‍♀️,🧙🏼‍♀️,🧙🏽‍♀️,🧙🏾‍♀️,🧙🏿‍♀️,🧙🏻‍♂️,🧙🏼‍♂️,🧙🏽‍♂️,🧙🏾‍♂️,🧙🏿‍♂️,🧝🏻,🧝🏼,🧝🏽,🧝🏾,🧝🏿,🧝🏻‍♀️,🧝🏼‍♀️,🧝🏽‍♀️,🧝🏾‍♀️,🧝🏿‍♀️,🧝🏻‍♂️,🧝🏼‍♂️,🧝🏽‍♂️,🧝🏾‍♂️,🧝🏿‍♂️,🧛🏻,🧛🏼,🧛🏽,🧛🏾,🧛🏿,🧛🏻‍♀️,🧛🏼‍♀️,🧛🏽‍♀️,🧛🏾‍♀️,🧛🏿‍♀️,🧛🏻‍♂️,🧛🏼‍♂️,🧛🏽‍♂️,🧛🏾‍♂️,🧛🏿‍♂️,🧜🏻,🧜🏼,🧜🏽,🧜🏾,🧜🏿,🧜🏻‍♀️,🧜🏼‍♀️,🧜🏽‍♀️,🧜🏾‍♀️,🧜🏿‍♀️,🧜🏻‍♂️,🧜🏼‍♂️,🧜🏽‍♂️,🧜🏾‍♂️,🧜🏿‍♂️,🧚🏻,🧚🏼,🧚🏽,🧚🏾,🧚🏿,🧚🏻‍♀️,🧚🏼‍♀️,🧚🏽‍♀️,🧚🏾‍♀️,🧚🏿‍♀️,🧚🏻‍♂️,🧚🏼‍♂️,🧚🏽‍♂️,🧚🏾‍♂️,🧚🏿‍♂️,👼🏻,👼🏼,👼🏽,👼🏾,👼🏿,🫄🏻,🫄🏼,🫄🏽,🫄🏾,🫄🏿,🤰🏻,🤰🏼,🤰🏽,🤰🏾,🤰🏿,🫃🏻,🫃🏼,🫃🏽,🫃🏾,🫃🏿,🤱🏻,🤱🏼,🤱🏽,🤱🏾,🤱🏿,🧑🏻‍🍼,🧑🏼‍🍼,🧑🏽‍🍼,🧑🏾‍🍼,🧑🏿‍🍼,👩🏻‍🍼,👩🏼‍🍼,👩🏽‍🍼,👩🏾‍🍼,👩🏿‍🍼,👨🏻‍🍼,👨🏼‍🍼,👨🏽‍🍼,👨🏾‍🍼,👨🏿‍🍼,🙇🏻,🙇🏼,🙇🏽,🙇🏾,🙇🏿,🙇🏻‍♀️,🙇🏼‍♀️,🙇🏽‍♀️,🙇🏾‍♀️,🙇🏿‍♀️,🙇🏻‍♂️,🙇🏼‍♂️,🙇🏽‍♂️,🙇🏾‍♂️,🙇🏿‍♂️,💁🏻,💁🏼,💁🏽,💁🏾,💁🏿,💁🏻‍♀️,💁🏼‍♀️,💁🏽‍♀️,💁🏾‍♀️,💁🏿‍♀️,💁🏻‍♂️,💁🏼‍♂️,💁🏽‍♂️,💁🏾‍♂️,💁🏿‍♂️,🙅🏻,🙅🏼,🙅🏽,🙅🏾,🙅🏿,🙅🏻‍♀️,🙅🏼‍♀️,🙅🏽‍♀️,🙅🏾‍♀️,🙅🏿‍♀️,🙅🏻‍♂️,🙅🏼‍♂️,🙅🏽‍♂️,🙅🏾‍♂️,🙅🏿‍♂️,🙆🏻,🙆🏼,🙆🏽,🙆🏾,🙆🏿,🙆🏻‍♀️,🙆🏼‍♀️,🙆🏽‍♀️,🙆🏾‍♀️,🙆🏿‍♀️,🙆🏻‍♂️,🙆🏼‍♂️,🙆🏽‍♂️,🙆🏾‍♂️,🙆🏿‍♂️,🙋🏻,🙋🏼,🙋🏽,🙋🏾,🙋🏿,🙋🏻‍♀️,🙋🏼‍♀️,🙋🏽‍♀️,🙋🏾‍♀️,🙋🏿‍♀️,🙋🏻‍♂️,🙋🏼‍♂️,🙋🏽‍♂️,🙋🏾‍♂️,🙋🏿‍♂️,🧏🏻,🧏🏼,🧏🏽,🧏🏾,🧏🏿,🧏🏻‍♀️,🧏🏼‍♀️,🧏🏽‍♀️,🧏🏾‍♀️,🧏🏿‍♀️,🧏🏻‍♂️,🧏🏼‍♂️,🧏🏽‍♂️,🧏🏾‍♂️,🧏🏿‍♂️,🤦🏻,🤦🏼,🤦🏽,🤦🏾,🤦🏿,🤦🏻‍♀️,🤦🏼‍♀️,🤦🏽‍♀️,🤦🏾‍♀️,🤦🏿‍♀️,🤦🏻‍♂️,🤦🏼‍♂️,🤦🏽‍♂️,🤦🏾‍♂️,🤦🏿‍♂️,🤷🏻,🤷🏼,🤷🏽,🤷🏾,🤷🏿,🤷🏻‍♀️,🤷🏼‍♀️,🤷🏽‍♀️,🤷🏾‍♀️,🤷🏿‍♀️,🤷🏻‍♂️,🤷🏼‍♂️,🤷🏽‍♂️,🤷🏾‍♂️,🤷🏿‍♂️,🙎🏻,🙎🏼,🙎🏽,🙎🏾,🙎🏿,🙎🏻‍♀️,🙎🏼‍♀️,🙎🏽‍♀️,🙎🏾‍♀️,🙎🏿‍♀️,🙎🏻‍♂️,🙎🏼‍♂️,🙎🏽‍♂️,🙎🏾‍♂️,🙎🏿‍♂️,🙍🏻,🙍🏼,🙍🏽,🙍🏾,🙍🏿,🙍🏻‍♀️,🙍🏼‍♀️,🙍🏽‍♀️,🙍🏾‍♀️,🙍🏿‍♀️,🙍🏻‍♂️,🙍🏼‍♂️,🙍🏽‍♂️,🙍🏾‍♂️,🙍🏿‍♂️,💇🏻,💇🏼,💇🏽,💇🏾,💇🏿,💇🏻‍♀️,💇🏼‍♀️,💇🏽‍♀️,💇🏾‍♀️,💇🏿‍♀️,💇🏻‍♂️,💇🏼‍♂️,💇🏽‍♂️,💇🏾‍♂️,💇🏿‍♂️,💆🏻,💆🏼,💆🏽,💆🏾,💆🏿,💆🏻‍♀️,💆🏼‍♀️,💆🏽‍♀️,💆🏾‍♀️,💆🏿‍♀️,💆🏻‍♂️,💆🏼‍♂️,💆🏽‍♂️,💆🏾‍♂️,💆🏿‍♂️,🧖🏻,🧖🏼,🧖🏽,🧖🏾,🧖🏿,🧖🏻‍♀️,🧖🏼‍♀️,🧖🏽‍♀️,🧖🏾‍♀️,🧖🏿‍♀️,🧖🏻‍♂️,🧖🏼‍♂️,🧖🏽‍♂️,🧖🏾‍♂️,🧖🏿‍♂️,💅🏻,💅🏼,💅🏽,💅🏾,💅🏿,🤳🏻,🤳🏼,🤳🏽,🤳🏾,🤳🏿,💃🏻,💃🏼,💃🏽,💃🏾,💃🏿,🕺🏻,🕺🏼,🕺🏽,🕺🏿,🕺🏾,🕴🏻,🕴🏼,🕴🏽,🕴🏾,🕴🏿,🧑🏻‍🦽,🧑🏼‍🦽,🧑🏽‍🦽,🧑🏾‍🦽,🧑🏿‍🦽,👩🏻‍🦽,👩🏼‍🦽,👩🏽‍🦽,👩🏾‍🦽,👩🏿‍🦽,👨🏻‍🦽,👨🏼‍🦽,👨🏽‍🦽,👨🏾‍🦽,👨🏿‍🦽,🧑🏻‍🦼,🧑🏼‍🦼,🧑🏽‍🦼,🧑🏾‍🦼,🧑🏿‍🦼,👩🏻‍🦼,👩🏼‍🦼,👩🏽‍🦼,👩🏾‍🦼,👩🏿‍🦼,👨🏻‍🦼,👨🏼‍🦼,👨🏽‍🦼,👨🏾‍🦼,👨🏿‍🦼,🚶🏻,🚶🏼,🚶🏽,🚶🏾,🚶🏿,🚶🏻‍♀️,🚶🏼‍♀️,🚶🏽‍♀️,🚶🏾‍♀️,🚶🏿‍♀️,🚶🏻‍♂️,🚶🏼‍♂️,🚶🏽‍♂️,🚶🏾‍♂️,🚶🏿‍♂️,🧑🏻‍🦯,🧑🏼‍🦯,🧑🏽‍🦯,🧑🏾‍🦯,🧑🏿‍🦯,👩🏻‍🦯,👩🏼‍🦯,👩🏽‍🦯,👩🏾‍🦯,👩🏿‍🦯,👨🏻‍🦯,👨🏼‍🦯,👨🏽‍🦯,👨🏾‍🦯,👨🏿‍🦯,🧎🏻,🧎🏼,🧎🏽,🧎🏾,🧎🏿,🧎🏻‍♀️,🧎🏼‍♀️,🧎🏽‍♀️,🧎🏾‍♀️,🧎🏿‍♀️,🧎🏻‍♂️,🧎🏼‍♂️,🧎🏽‍♂️,🧎🏾‍♂️,🧎🏿‍♂️,🏃🏻,🏃🏼,🏃🏽,🏃🏾,🏃🏿,🏃🏻‍♀️,🏃🏼‍♀️,🏃🏽‍♀️,🏃🏾‍♀️,🏃🏿‍♀️,🏃🏻‍♂️,🏃🏼‍♂️,🏃🏽‍♂️,🏃🏾‍♂️,🏃🏿‍♂️,🧍🏻,🧍🏼,🧍🏽,🧍🏾,🧍🏿,🧍🏻‍♀️,🧍🏼‍♀️,🧍🏽‍♀️,🧍🏾‍♀️,🧍🏿‍♀️,🧍🏻‍♂️,🧍🏼‍♂️,🧍🏽‍♂️,🧍🏾‍♂️,🧍🏿‍♂️,🧑🏻‍🤝‍🧑🏻,🧑🏻‍🤝‍🧑🏼,🧑🏻‍🤝‍🧑🏽,🧑🏻‍🤝‍🧑🏾,🧑🏻‍🤝‍🧑🏿,🧑🏼‍🤝‍🧑🏻,🧑🏼‍🤝‍🧑🏼,🧑🏼‍🤝‍🧑🏽,🧑🏼‍🤝‍🧑🏾,🧑🏼‍🤝‍🧑🏿,🧑🏽‍🤝‍🧑🏻,🧑🏽‍🤝‍🧑🏼,🧑🏽‍🤝‍🧑🏽,🧑🏽‍🤝‍🧑🏾,🧑🏽‍🤝‍🧑🏿,🧑🏾‍🤝‍🧑🏻,🧑🏾‍🤝‍🧑🏼,🧑🏾‍🤝‍🧑🏽,🧑🏾‍🤝‍🧑🏾,🧑🏾‍🤝‍🧑🏿,🧑🏿‍🤝‍🧑🏻,🧑🏿‍🤝‍🧑🏼,🧑🏿‍🤝‍🧑🏽,🧑🏿‍🤝‍🧑🏾,🧑🏿‍🤝‍🧑🏿,👫🏻,👩🏻‍🤝‍👨🏼,👩🏻‍🤝‍👨🏽,👩🏻‍🤝‍👨🏾,👩🏻‍🤝‍👨🏿,👩🏼‍🤝‍👨🏻,👫🏼,👩🏼‍🤝‍👨🏽,👩🏼‍🤝‍👨🏾,👩🏼‍🤝‍👨🏿,👩🏽‍🤝‍👨🏻,👩🏽‍🤝‍👨🏼,👫🏽,👩🏽‍🤝‍👨🏾,👩🏽‍🤝‍👨🏿,👩🏾‍🤝‍👨🏻,👩🏾‍🤝‍👨🏼,👩🏾‍🤝‍👨🏽,👫🏾,👩🏾‍🤝‍👨🏿,👩🏿‍🤝‍👨🏻,👩🏿‍🤝‍👨🏼,👩🏿‍🤝‍👨🏽,👩🏿‍🤝‍👨🏾,👫🏿,👭🏻,👩🏻‍🤝‍👩🏼,👩🏻‍🤝‍👩🏽,👩🏻‍🤝‍👩🏾,👩🏻‍🤝‍👩🏿,👩🏼‍🤝‍👩🏻,👭🏼,👩🏼‍🤝‍👩🏽,👩🏼‍🤝‍👩🏾,👩🏼‍🤝‍👩🏿,👩🏽‍🤝‍👩🏻,👩🏽‍🤝‍👩🏼,👭🏽,👩🏽‍🤝‍👩🏾,👩🏽‍🤝‍👩🏿,👩🏾‍🤝‍👩🏻,👩🏾‍🤝‍👩🏼,👩🏾‍🤝‍👩🏽,👭🏾,👩🏾‍🤝‍👩🏿,👩🏿‍🤝‍👩🏻,👩🏿‍🤝‍👩🏼,👩🏿‍🤝‍👩🏽,👩🏿‍🤝‍👩🏾,👭🏿,👬🏻,👨🏻‍🤝‍👨🏼,👨🏻‍🤝‍👨🏽,👨🏻‍🤝‍👨🏾,👨🏻‍🤝‍👨🏿,👨🏼‍🤝‍👨🏻,👬🏼,👨🏼‍🤝‍👨🏽,👨🏼‍🤝‍👨🏾,👨🏼‍🤝‍👨🏿,👨🏽‍🤝‍👨🏻,👨🏽‍🤝‍👨🏼,👬🏽,👨🏽‍🤝‍👨🏾,👨🏽‍🤝‍👨🏿,👨🏾‍🤝‍👨🏻,👨🏾‍🤝‍👨🏼,👨🏾‍🤝‍👨🏽,👬🏾,👨🏾‍🤝‍👨🏿,👨🏿‍🤝‍👨🏻,👨🏿‍🤝‍👨🏼,👨🏿‍🤝‍👨🏽,👨🏿‍🤝‍👨🏾,👬🏿,💑🏻,🧑🏻‍❤️‍🧑🏼,🧑🏻‍❤️‍🧑🏽,🧑🏻‍❤️‍🧑🏾,🧑🏻‍❤️‍🧑🏿,🧑🏼‍❤️‍🧑🏻,💑🏼,🧑🏼‍❤️‍🧑🏽,🧑🏼‍❤️‍🧑🏾,🧑🏼‍❤️‍🧑🏿,🧑🏽‍❤️‍🧑🏻,🧑🏽‍❤️‍🧑🏼,💑🏽,🧑🏽‍❤️‍🧑🏾,🧑🏽‍❤️‍🧑🏿,🧑🏾‍❤️‍🧑🏻,🧑🏾‍❤️‍🧑🏼,🧑🏾‍❤️‍🧑🏽,💑🏾,🧑🏾‍❤️‍🧑🏿,🧑🏿‍❤️‍🧑🏻,🧑🏿‍❤️‍🧑🏼,🧑🏿‍❤️‍🧑🏽,🧑🏿‍❤️‍🧑🏾,💑🏿,👩🏻‍❤️‍👨🏻,👩🏻‍❤️‍👨🏼,👩🏻‍❤️‍👨🏽,👩🏻‍❤️‍👨🏾,👩🏻‍❤️‍👨🏿,👩🏼‍❤️‍👨🏻,👩🏼‍❤️‍👨🏼,👩🏼‍❤️‍👨🏽,👩🏼‍❤️‍👨🏾,👩🏼‍❤️‍👨🏿,👩🏽‍❤️‍👨🏻,👩🏽‍❤️‍👨🏼,👩🏽‍❤️‍👨🏽,👩🏽‍❤️‍👨🏾,👩🏽‍❤️‍👨🏿,👩🏾‍❤️‍👨🏻,👩🏾‍❤️‍👨🏼,👩🏾‍❤️‍👨🏽,👩🏾‍❤️‍👨🏾,👩🏾‍❤️‍👨🏿,👩🏿‍❤️‍👨🏻,👩🏿‍❤️‍👨🏼,👩🏿‍❤️‍👨🏽,👩🏿‍❤️‍👨🏾,👩🏿‍❤️‍👨🏿,👩🏻‍❤️‍👩🏻,👩🏻‍❤️‍👩🏼,👩🏻‍❤️‍👩🏽,👩🏻‍❤️‍👩🏾,👩🏻‍❤️‍👩🏿,👩🏼‍❤️‍👩🏻,👩🏼‍❤️‍👩🏼,👩🏼‍❤️‍👩🏽,👩🏼‍❤️‍👩🏾,👩🏼‍❤️‍👩🏿,👩🏽‍❤️‍👩🏻,👩🏽‍❤️‍👩🏼,👩🏽‍❤️‍👩🏽,👩🏽‍❤️‍👩🏾,👩🏽‍❤️‍👩🏿,👩🏾‍❤️‍👩🏻,👩🏾‍❤️‍👩🏼,👩🏾‍❤️‍👩🏽,👩🏾‍❤️‍👩🏾,👩🏾‍❤️‍👩🏿,👩🏿‍❤️‍👩🏻,👩🏿‍❤️‍👩🏼,👩🏿‍❤️‍👩🏽,👩🏿‍❤️‍👩🏾,👩🏿‍❤️‍👩🏿,👨🏻‍❤️‍👨🏻,👨🏻‍❤️‍👨🏼,👨🏻‍❤️‍👨🏽,👨🏻‍❤️‍👨🏾,👨🏻‍❤️‍👨🏿,👨🏼‍❤️‍👨🏻,👨🏼‍❤️‍👨🏼,👨🏼‍❤️‍👨🏽,👨🏼‍❤️‍👨🏾,👨🏼‍❤️‍👨🏿,👨🏽‍❤️‍👨🏻,👨🏽‍❤️‍👨🏼,👨🏽‍❤️‍👨🏽,👨🏽‍❤️‍👨🏾,👨🏽‍❤️‍👨🏿,👨🏾‍❤️‍👨🏻,👨🏾‍❤️‍👨🏼,👨🏾‍❤️‍👨🏽,👨🏾‍❤️‍👨🏾,👨🏾‍❤️‍👨🏿,👨🏿‍❤️‍👨🏻,👨🏿‍❤️‍👨🏼,👨🏿‍❤️‍👨🏽,👨🏿‍❤️‍👨🏾,👨🏿‍❤️‍👨🏿,💏🏻,🧑🏻‍❤️‍💋‍🧑🏼,🧑🏻‍❤️‍💋‍🧑🏽,🧑🏻‍❤️‍💋‍🧑🏾,🧑🏻‍❤️‍💋‍🧑🏿,🧑🏼‍❤️‍💋‍🧑🏻,💏🏼,🧑🏼‍❤️‍💋‍🧑🏽,🧑🏼‍❤️‍💋‍🧑🏾,🧑🏼‍❤️‍💋‍🧑🏿,🧑🏽‍❤️‍💋‍🧑🏻,🧑🏽‍❤️‍💋‍🧑🏼,💏🏽,🧑🏽‍❤️‍💋‍🧑🏾,🧑🏽‍❤️‍💋‍🧑🏿,🧑🏾‍❤️‍💋‍🧑🏻,🧑🏾‍❤️‍💋‍🧑🏼,🧑🏾‍❤️‍💋‍🧑🏽,💏🏾,🧑🏾‍❤️‍💋‍🧑🏿,🧑🏿‍❤️‍💋‍🧑🏻,🧑🏿‍❤️‍💋‍🧑🏼,🧑🏿‍❤️‍💋‍🧑🏽,🧑🏿‍❤️‍💋‍🧑🏾,💏🏿,👩🏻‍❤️‍💋‍👨🏻,👩🏻‍❤️‍💋‍👨🏼,👩🏻‍❤️‍💋‍👨🏽,👩🏻‍❤️‍💋‍👨🏾,👩🏻‍❤️‍💋‍👨🏿,👩🏼‍❤️‍💋‍👨🏻,👩🏼‍❤️‍💋‍👨🏼,👩🏼‍❤️‍💋‍👨🏽,👩🏼‍❤️‍💋‍👨🏾,👩🏼‍❤️‍💋‍👨🏿,👩🏽‍❤️‍💋‍👨🏻,👩🏽‍❤️‍💋‍👨🏼,👩🏽‍❤️‍💋‍👨🏽,👩🏽‍❤️‍💋‍👨🏾,👩🏽‍❤️‍💋‍👨🏿,👩🏾‍❤️‍💋‍👨🏻,👩🏾‍❤️‍💋‍👨🏼,👩🏾‍❤️‍💋‍👨🏽,👩🏾‍❤️‍💋‍👨🏾,👩🏾‍❤️‍💋‍👨🏿,👩🏿‍❤️‍💋‍👨🏻,👩🏿‍❤️‍💋‍👨🏼,👩🏿‍❤️‍💋‍👨🏽,👩🏿‍❤️‍💋‍👨🏾,👩🏿‍❤️‍💋‍👨🏿,👩🏻‍❤️‍💋‍👩🏻,👩🏻‍❤️‍💋‍👩🏼,👩🏻‍❤️‍💋‍👩🏽,👩🏻‍❤️‍💋‍👩🏾,👩🏻‍❤️‍💋‍👩🏿,👩🏼‍❤️‍💋‍👩🏻,👩🏼‍❤️‍💋‍👩🏼,👩🏼‍❤️‍💋‍👩🏽,👩🏼‍❤️‍💋‍👩🏾,👩🏼‍❤️‍💋‍👩🏿,👩🏽‍❤️‍💋‍👩🏻,👩🏽‍❤️‍💋‍👩🏼,👩🏽‍❤️‍💋‍👩🏽,👩🏽‍❤️‍💋‍👩🏾,👩🏽‍❤️‍💋‍👩🏿,👩🏾‍❤️‍💋‍👩🏻,👩🏾‍❤️‍💋‍👩🏼,👩🏾‍❤️‍💋‍👩🏽,👩🏾‍❤️‍💋‍👩🏾,👩🏾‍❤️‍💋‍👩🏿,👩🏿‍❤️‍💋‍👩🏻,👩🏿‍❤️‍💋‍👩🏼,👩🏿‍❤️‍💋‍👩🏽,👩🏿‍❤️‍💋‍👩🏾,👩🏿‍❤️‍💋‍👩🏿,👨🏻‍❤️‍💋‍👨🏻,👨🏻‍❤️‍💋‍👨🏼,👨🏻‍❤️‍💋‍👨🏽,👨🏻‍❤️‍💋‍👨🏾,👨🏻‍❤️‍💋‍👨🏿,👨🏼‍❤️‍💋‍👨🏻,👨🏼‍❤️‍💋‍👨🏼,👨🏼‍❤️‍💋‍👨🏽,👨🏼‍❤️‍💋‍👨🏾,👨🏼‍❤️‍💋‍👨🏿,👨🏽‍❤️‍💋‍👨🏻,👨🏽‍❤️‍💋‍👨🏼,👨🏽‍❤️‍💋‍👨🏽,👨🏽‍❤️‍💋‍👨🏾,👨🏽‍❤️‍💋‍👨🏿,👨🏾‍❤️‍💋‍👨🏻,👨🏾‍❤️‍💋‍👨🏼,👨🏾‍❤️‍💋‍👨🏽,👨🏾‍❤️‍💋‍👨🏾,👨🏾‍❤️‍💋‍👨🏿,👨🏿‍❤️‍💋‍👨🏻,👨🏿‍❤️‍💋‍👨🏼,👨🏿‍❤️‍💋‍👨🏽,👨🏿‍❤️‍💋‍👨🏾,👨🏿‍❤️‍💋‍👨🏿,🦱,🦰,🦳,🦲,🏂🏻,🏂🏼,🏂🏽,🏂🏾,🏂🏿,🏋🏻,🏋🏼,🏋🏽,🏋🏾,🏋🏿,🏋🏻‍♀️,🏋🏼‍♀️,🏋🏽‍♀️,🏋🏾‍♀️,🏋🏿‍♀️,🏋🏻‍♂️,🏋🏼‍♂️,🏋🏽‍♂️,🏋🏾‍♂️,🏋🏿‍♂️,🤸🏻,🤸🏼,🤸🏽,🤸🏾,🤸🏿,🤸🏻‍♀️,🤸🏼‍♀️,🤸🏽‍♀️,🤸🏾‍♀️,🤸🏿‍♀️,🤸🏻‍♂️,🤸🏼‍♂️,🤸🏽‍♂️,🤸🏾‍♂️,🤸🏿‍♂️,⛹🏻,⛹🏼,⛹🏽,⛹🏾,⛹🏿,⛹🏻‍♀️,⛹🏼‍♀️,⛹🏽‍♀️,⛹🏾‍♀️,⛹🏿‍♀️,⛹🏻‍♂️,⛹🏼‍♂️,⛹🏽‍♂️,⛹🏾‍♂️,⛹🏿‍♂️,🤾🏻,🤾🏼,🤾🏽,🤾🏾,🤾🏿,🤾🏻‍♀️,🤾🏼‍♀️,🤾🏽‍♀️,🤾🏾‍♀️,🤾🏿‍♀️,🤾🏻‍♂️,🤾🏼‍♂️,🤾🏽‍♂️,🤾🏾‍♂️,🤾🏿‍♂️,🏌🏻,🏌🏼,🏌🏽,🏌🏾,🏌🏿,🏌🏻‍♀️,🏌🏼‍♀️,🏌🏽‍♀️,🏌🏾‍♀️,🏌🏿‍♀️,🏌🏻‍♂️,🏌🏼‍♂️,🏌🏽‍♂️,🏌🏾‍♂️,🏌🏿‍♂️,🏇🏻,🏇🏼,🏇🏽,🏇🏾,🏇🏿,🧘🏻,🧘🏼,🧘🏽,🧘🏾,🧘🏿,🧘🏻‍♀️,🧘🏼‍♀️,🧘🏽‍♀️,🧘🏾‍♀️,🧘🏿‍♀️,🧘🏻‍♂️,🧘🏼‍♂️,🧘🏽‍♂️,🧘🏾‍♂️,🧘🏿‍♂️,🏄🏻,🏄🏼,🏄🏽,🏄🏾,🏄🏿,🏄🏻‍♀️,🏄🏼‍♀️,🏄🏽‍♀️,🏄🏾‍♀️,🏄🏿‍♀️,🏄🏻‍♂️,🏄🏼‍♂️,🏄🏽‍♂️,🏄🏾‍♂️,🏄🏿‍♂️,🏊🏻,🏊🏼,🏊🏽,🏊🏾,🏊🏿,🏊🏻‍♀️,🏊🏼‍♀️,🏊🏽‍♀️,🏊🏾‍♀️,🏊🏿‍♀️,🏊🏻‍♂️,🏊🏼‍♂️,🏊🏽‍♂️,🏊🏾‍♂️,🏊🏿‍♂️,🤽🏻,🤽🏼,🤽🏽,🤽🏾,🤽🏿,🤽🏻‍♀️,🤽🏼‍♀️,🤽🏽‍♀️,🤽🏾‍♀️,🤽🏿‍♀️,🤽🏻‍♂️,🤽🏼‍♂️,🤽🏽‍♂️,🤽🏾‍♂️,🤽🏿‍♂️,🚣🏻,🚣🏼,🚣🏽,🚣🏾,🚣🏿,🚣🏻‍♀️,🚣🏼‍♀️,🚣🏽‍♀️,🚣🏾‍♀️,🚣🏿‍♀️,🚣🏻‍♂️,🚣🏼‍♂️,🚣🏽‍♂️,🚣🏾‍♂️,🚣🏿‍♂️,🧗🏻,🧗🏼,🧗🏽,🧗🏾,🧗🏿,🧗🏻‍♀️,🧗🏼‍♀️,🧗🏽‍♀️,🧗🏾‍♀️,🧗🏿‍♀️,🧗🏻‍♂️,🧗🏼‍♂️,🧗🏽‍♂️,🧗🏾‍♂️,🧗🏿‍♂️,🚵🏻,🚵🏼,🚵🏽,🚵🏾,🚵🏿,🚵🏻‍♀️,🚵🏼‍♀️,🚵🏽‍♀️,🚵🏾‍♀️,🚵🏿‍♀️,🚵🏻‍♂️,🚵🏼‍♂️,🚵🏽‍♂️,🚵🏾‍♂️,🚵🏿‍♂️,🚴🏻,🚴🏼,🚴🏽,🚴🏾,🚴🏿,🚴🏻‍♀️,🚴🏼‍♀️,🚴🏽‍♀️,🚴🏾‍♀️,🚴🏿‍♀️,🚴🏻‍♂️,🚴🏼‍♂️,🚴🏽‍♂️,🚴🏾‍♂️,🚴🏿‍♂️,🤹🏻,🤹🏼,🤹🏽,🤹🏾,🤹🏿,🤹🏻‍♀️,🤹🏼‍♀️,🤹🏽‍♀️,🤹🏾‍♀️,🤹🏿‍♀️,🤹🏻‍♂️,🤹🏼‍♂️,🤹🏽‍♂️,🤹🏾‍♂️,🤹🏿‍♂️,🛀🏻,🛀🏼,🛀🏽,🛀🏾,🛀🏿,🛌🏻,🛌🏼,🛌🏽,🛌🏾,🛌🏿,🏻,🏼,🏽,🏾,🏿,🇿,🇾,🇽,🇼,🇻,🇺,🇹,🇸,🇷,🇶,🇵,🇴,🇳,🇲,🇱,🇰,🇯,🇮,🇭,🇬,🇫,🇪,🇩,🇨,🇧,🇦'.split(",");

(async()=>{
  if(tfl.cookie("user.user")){
    window.friends=await _t.call2("chat_friend");
    window.friends=window.friends.data||[];
    let t=await soc.getChatHis();
    t=Object.values(t).flat();
    t.filter(m=>m.tid=m.data.data.id);
    await db("chat").add(t);
  }else{window.friends=[]}
})();
window.color='aqua,aquamarine,beige,bisque,black,blanchedalmond,blue,blueviolet,brown,burlywood,cadetblue,chartreuse,chocolate,coral,cornflowerblue,crimson,cyan,darkblue,darkcyan,darkgoldenrod,darkgray,darkgreen,darkgrey,darkkhaki,darkmagenta,darkolivegreen,darkorange,darkorchid,darkred,darksalmon,darkseagreen,darkslateblue,darkslategray,darkslategrey,darkturquoise,darkviolet,deeppink,deepskyblue,dimgray,dimgrey,dodgerblue,firebrick,forestgreen,fuchsia,gainsboro,gold,goldenrod,gray,green,greenyellow,grey,hotpink,indianred,indigo,khaki,lavender,lawngreen,lime,limegreen,linen,magenta,maroon,mediumaquamarine,mediumblue,mediumorchid,mediumpurple,mediumseagreen,mediumslateblue,mediumspringgreen,mediumturquoise,mediumvioletred,midnightblue,mistyrose,moccasin,navy,olive,olivedrab,orange,orangered,orchid,palegoldenrod,palegreen,paleturquoise,palevioletred,papayawhip,peachpuff,peru,pink,plum,powderblue,purple,rebeccapurple,red,rosybrown,royalblue,saddlebrown,salmon,sandybrown,seagreen,sienna,silver,skyblue,slateblue,slategray,slategrey,springgreen,steelblue,tan,teal,thistle,tomato,turquoise,violet,wheat,yellowgreen'.split(",");

// Khoi tao ket noi
const socket = io("https://sw.tafalo.com/");

const peer = new Peer();
peer.on('open', function(id){window.peerId=id});
peer.on('connection',function(conn){
  conn.on("data",r=>{
    //console.log(r);
    receivedFile(r);
  });
});
//socket.on("connection", function (client) {console.log( client.request.connection.remoteAddress );})
// Lang nghe khi msg cua nguoi khac gui
socket.on("msg",async t => {
  //console.log(123,soc.send_T_data);
  //console.log(t,t.userId,t.data.data.id);
  if(t.data.type=="typing"){
    //console.log(123,t);
    if(window.send_T_typing){
      if(t.data.data){
        send_T_typing.innerHTML=`<div class="cg p5">`+t.data.user+`: Typing...</div>`;
      }else{
        send_T_typing.innerHTML=``;
      }
    }
  }else{

    if(t.data.type=="peer"||t.data.type=="receivedPeer"){
      if(t.data.type=="peer"){soc.receivedPeer(t.userId,t.data.data);}else{
        window.peerTo=t.data.peer;
        window.peerToId=t.data.data;
      }
    }

    if(t.data.type=="data"){
      soc.received(t.userId,t.data.data.id);
      appendD(t);
      t.tid=t.data.data.id;
      db("chat").add(t);
    }else{
      //console.log("đã nhận",t);
      appendD2(t);
    }
    soc.send_T_data.push(t);
    soc.send_T_data=soc.send_T_data.slice(-5000);
    db("chat").add(soc.send_T_data);

    send_T_typing.innerHTML=``;
  }
});

((soc)=>{
  soc.userActive=()=>{
    document.querySelectorAll(".user").forEach(m=>{m.classList.remove("color-blue")});
    if(document.querySelector("#id_"+sendto_T_.split("@").join("_acong_"))){
      document.querySelector("#id_"+sendto_T_.split("@").join("_acong_")).classList.add("color-blue");
    }
  };
  soc.chatFriends=async()=>{
    //popupT2("pop2","","The chat feature is currently under maintenance.","Alert",1); return;
    window.friends=window.friends||[];
    window.chatMenu="friends";
    let his=await db.chat.find();
    let ds=window.friends;
    ds=ds.map(m=>{
      let len=his.filter(n=>{
        let t=m!=tfl.cookie("user.user")&&(n.data.data.user==m||n.userId==m);
        if(m==tfl.cookie("user.user")){t=n.data.data.user==m&&n.userId==m}
        return t;
      });
      let len1=len.filter(n=>n.view);
      let o={len:len.length,len1:len1.length,d:`<div class="w100 df aic mt10 cp pr zi-1 user" id="id_`+m.split("@").join("_acong_")+`"><div class="fl wh36 fs23 p10 df aic jcc bdr fwb me10 cf" style="background:`+color[Math.floor(Math.random()*(color.length-1))]+`">`+m[0]+`</div><span class="me5">`+m+`</span> `+(window.userT==m?`<span class="color-blue"> (Me)</span>`:``)+` `+(len.length?`(<span class="`+(len.length!=len1.length?`color-orange`:`cg`)+`">`+len1.length+`</span>/<span class="cg">`+len.length+`</span>)`:``)+`<div class="ml-auto">`+(window.friends.includes(m)?``:`<div onclick="soc.addFriend('`+m+`')" class="wh36 cg bd bdr10 cp aic jcc df">+</div>`)+`</div></div>`};
      return o;
    });
    ds.sort((a,b)=>(a.len>b.len?-1:1));
    ds.sort((a,b)=>(a.len1>b.len1?-1:1));
    send_T_list.innerHTML=`<div class="p20">
          	`+ds.map(m=>m.d).join("")+`
          </div>`;

    document.querySelectorAll("#send_T_box svg").forEach(m=>{let n=m.parentNode;n.classList.remove("f-orange");n.classList.add("f-gray");});
    document.querySelector("#send_T_box .icon_group").classList.add("f-orange");
    document.querySelector("#send_T_box .icon_group").classList.remove("f-gray");

    listenClickUser();
  };
  soc.addFriend=async(toUser)=>{
    if(!window.friends.includes(toUser)){
      window.friends.push(toUser);
      let t=await _t.call2("chat_friend",{toUser:toUser});
      if(t.result){
        popupT2("pop23","","Successfully added "+toUser+" to your contacts!","Add Friend",1);
      }else{popupT2("pop23","","Failed to add contact!","Add Friend",1);}
    }else{popupT2("pop23","",toUser+" already exists in your contacts.!","Add Friend",1);}
  };
  soc.onlines=()=>{
    window.friends=window.friends||[];
    window.chatMenu="";
    if(document.querySelector("#send_T_box .icon_globe")){
      document.querySelectorAll("#send_T_box svg").forEach(m=>{
        let n=m.parentNode;
        n.classList.remove("f-orange");
        n.classList.add("f-gray");
      });
      document.querySelector("#send_T_box .icon_globe").classList.add("f-orange");
      document.querySelector("#send_T_box .icon_globe").classList.remove("f-gray");
    }
    return new Promise(async (r3)=>{
      await fetch("https://sw.tafalo.com/online").then(r=>r.json()).then(async r=>{
        if(window.send_T_list){
          let ds=r.data;
          window.onl=ds;
          //ds=[...new Set(ds)];
          let ds1=ds;
          let his=await db.chat.find();

          let len2=his.filter(m=>!m.view&&m.data&&m.data.type=="data").length;
          if(window.noti){noti.innerHTML=len2}
          ds=ds.map(m=>{
            let len=his.filter(n=>{
              let t=m!=tfl.cookie("user.user")&&(n.data.data.user==m||n.userId==m);
              if(m==tfl.cookie("user.user")){t=n.data.data.user==m&&n.userId==m}
              return t;
            });

            let len1=len.filter(n=>n.view);
            let o={len:len.length,len1:len1.length,d:`<div class="w100 df aic mt10 cp pr zi-1 user" id="id_`+m.split("@").join("_acong_")+`"><div class="fl wh36 fs23 p10 df aic jcc bdr fwb me10 cf" style="background:`+color[Math.floor(Math.random()*(color.length-1))]+`">`+m[0]+`</div><span class="me5">`+m+`</span> `+(window.userT==m?`<span class="color-blue"> (Me)</span>`:``)+` `+(len.length?`(<span class="`+(len.length!=len1.length?`color-orange`:`cg`)+`">`+len1.length+`</span>/<span class="cg">`+len.length+`</span>)`:``)+`<div class="ml-auto">`+(window.friends.includes(m)?``:`<div onclick="soc.addFriend('`+m+`')" class="wh36 cg bd bdr10 cp aic jcc df">+</div>`)+`</div></div>`};
            return o;
          });
          ds.sort((a,b)=>(a.len>b.len?-1:1));
          ds.sort((a,b)=>(a.len1>b.len1?-1:1));
         
          send_T_list.innerHTML=`<div class="p20">
          	`+ds.map(m=>m.d).join("")+`
          </div>`;
          listenClickUser();
        }
        r3(r);
      });
    });
  };
  soc.user=async(user)=>{
    if(!user){return;}
    socket.emit("user", {userId:user});
    soc.send_T_data=await db("chat").find({})||[];
  };
  soc.send=async(user,content)=>{
    let tid=Date.now().toString(36)+(Math.floor(Math.random() * Date.now())).toString(36).padStart(8,"0");
    if(!window.userT){
      soc.user(tid);
    }
    let time=await tfl.getTime()||Date.now();
    let ob={time:time, userId: user, data: {type:"data",data:{id:tid,content:content,user:user}}};

    let t=await _t.call2("chat_cache",{toUser:user,content:soc.encode21(content)});

    ob.data.data.id=t.tid;
    ob.tid=t.tid;
    socket.emit("send", ob);
    ob.userId=tfl.cookie("user.user");
    appendD(ob);
    if(onl.indexOf(user)<0){
      _t.call2("notify_send2",{user:user,title:user,content:content});
    }
    soc.send_T_data.push(ob);
    db("chat").add(ob);
  };
  soc.typing=(user,user2,v)=>{
    socket.emit("send", {userId: user, data: {type:"typing",data:v,user:user2}});
  };
  soc.received=(user,id)=>{
    socket.emit("send", {userId: user, data: {type:"received",data:id,user:user}});
  };
  soc.encode21=(text)=>{
    let c=new TextEncoder();
    let a=c.encode(text);
    let r=[];
    a.forEach(m=>r.push(String(m).padStart(3,"0")));
    return r.join("");
  };
  soc.sendPeer=()=>{
    let tid=Date.now().toString(36)+(Math.floor(Math.random() * Date.now())).toString(36).padStart(8,"0");
    socket.emit("send",{userId:window.sendto_T_,data:{type:"peer",data:tid,peer:window.peerId}});
    files.click();
  };
  soc.receivedPeer=(user,id)=>{
    socket.emit("send",{userId:user,data:{data:id,type:"receivedPeer",user:user,peer:window.peerId}});
  };
  soc.getChatByUser=async(m,all)=>{
    let ob={};
    let t=await _t.call2("chat_cache",{toUser:m});
    t=t.data||[];
    let len=t.length>1?1:t.length;
    if(all){len=t.length;}
    ob[m]=[];
    for(let j=0;j<len;j++){
      let n=t[j];
      let o={};
      o.data={};
      o.data.type="data";
      o.data.data={};
      let t1=await _t.call2("chat_cache",{toUser:m,path:n});
      t1=t1.data||[];
      t1=t1.join("").match(/.{1,3}/g).map(m=>Number(m));
      t1=new Uint8Array(t1);
      let d=new TextDecoder();
      o.data.data.content=d.decode(t1);
      let time=n.split("_").pop();
      let userSend=n.split("_"+time).join("");
      o.data.data.user=(userSend==tfl.cookie("user.user")?m:tfl.cookie("user.user"));
      o.data.data.id=n;
      o.time=Number(time)*1000;
      o.userId=userSend;
      ob[m].push(o);
    }
    return ob[m];
  };
  soc.chatHistory=async()=>{
    send_T_list.innerHTML=`<div>Loading...</div>`+send_T_list.innerHTML;
    //popupT2("pop2","","The chat feature is currently under maintenance.","Alert",1); return;
    window.chatMenu="history";
    let u=tfl.cookie("user.user");
    if(!u){return}
    let ob={};
    let d=await _t.call2("chat_cache");
    d=d.data||[];
    d=d.filter(m=>m.split("_-_").indexOf(u)>=0);
    let ds=d.map(m=>m.split("_-_")).flat().filter(m=>m!=u);
    for(let i=0;i<ds.length;i++){
      let m=ds[i];
      ob[m]=await soc.getChatByUser(m);
    }
    let code=Object.keys(ob).map(m=>{
      return {time:ob[m][0].time,d:`<div class="dg col_1 mt10">
            <div class="df user" id="id_`+m+`">
                <div class="fl wh36 fs23 p10 df aic jcc bdr fwb me10 cf" style="background:`+color[color.length%ob[m][0].data.data.content.length]+`">`+m[0]+`</div>
                <div class="lh100">
                    <b class="cg">`+m+`</b>
                    <div class="mt5 mb5">`+ob[m][0].userId+": "+ob[m][0].data.data.content+`</div>
                    <i class="cg">`+(new Date(ob[m][0].time).toLocaleString())+`</i>
                </div>
            </div>
        </div>`};
    });
    code.sort((a,b)=>(a.time>b.time?-1:1));
    code=code.map(m=>m.d);
    send_T_list.innerHTML=`<div class="p20">
          	`+code.join("")+`
          </div>`;

    document.querySelectorAll("#send_T_box svg").forEach(m=>{let n=m.parentNode;n.classList.remove("f-orange");n.classList.add("f-gray");});
    document.querySelector("#send_T_box .icon_history").classList.add("f-orange");
    document.querySelector("#send_T_box .icon_history").classList.remove("f-gray");
    listenClickUser();
  };

  soc.getChatHis=async(user)=>{
    let ob={};
    let ds=window.friends;
    if(user){ds=[user]}
    for(let i=0;i<ds.length;i++){
      let m=ds[i];
      //console.log(m);
      ob[m]=await soc.getChatByUser(m,(user?1:0));
      //console.log(t);
    }
    return ob;
  };

  soc.emoji=(id,limit,skip,show)=>{
    let e=document.querySelector("#send_T_emoji");
    if(e){
      e.classList.toggle("dn");
    }
    if(id){
      let v=document.querySelector("#send_T_");
      if(document.querySelector("#send_T_")){tfl.insertText(v,emoji[id])}
      return emoji[id];
    }
    let t=window.emoji;
    //if(skip){t=t.slice(skip)}
    //if(limit){t=t.slice(0,limit)}
    //console.log(t.length);
    if(show){
      if(e){
        e.innerHTML=t.map((m,i)=>`<div class="p3 m3 cp fl" onclick="soc.emoji(`+i+`)">`+m+`</div>`).join("");
      }
    }
    return t;
  };
  soc.send_T_data=[];
})(window.soc=window.soc||{});

//window.addEventListener("load",()=>{
if(!document.querySelector("input #send_T_")){
  let div = document.createElement("div");
  div.classList.add("w350","w100","h100","pf","top-0","left-0","dg","col1", "oh","bg-white", "dn","shadow-md");
  div.id="send_T_form";
  document.querySelector("body").append(div);
  document.querySelector("#send_T_form").innerHTML=`
  	<div class="w100 bg-light df jcsb aic pa zi-9999 top-0" style="height:36px">
    	<div class="df">
        	<div id="chat_ls1" class="top-0 m5 wh23 dn icon_back cp"></div>
        	<div id="chat_with" class="top-0 m5 tc color-green fwb cp"></div>
        </div>
    	<div id="send_T_hide" class="wh23 m5 right-0 tc cg cp btn_close1"></div>
    </div>
          <div class="pa w100 bdb left-0" style="top:36px; height:calc(100% - 92px)">
          	<div id="send_T_list" class="pa bgeee bde w100 h100 top-0 left-0 oc"></div>
            <div id="send_T_his" class="pa w100 dn h100 top-0 right-0 oc"></div>
            <div id="send_T_typing" class="pa w100 bottom-0 left-0 bg-white"></div>
      </div>
          <div id="send_T_box" class="df pa w100 bottom-0 left-0 pb10 bg-light" style="height:46px">
          	<div class="df aic">
            	<div onclick="soc.emoji('',0,10,1)" class="m5 cp df">🤔</div>
                <div onclick="soc.sendPeer()" class="m5 cp df">📎</div>
      		</div>
          	<input id="send_T_" type="Text" class="p5 m5 bd bdr5 w100 df"/>
            <div class="df aic"><div class="p10 cp df" id="send_T_btn">Send</div></div>
      </div>
      <div id="send_T_emoji" class="zi-9999 fs36 wba bdb pf bg-white w350 h350 h90 w100 bottom-10% left-0 dn oc"></div>
        `;
  showChatMenu();
}
//});


function listenClickUser(user){
  if(user){
    document.querySelector("#send_T_show").click();
    setTimeout(async ()=>{
      document.querySelectorAll(".modal_header .btn_close").forEach(m=>m.click());
      await clickUser(user);
    },200);
  }else{
    document.querySelectorAll(".user").forEach(m=>{
      let v=m.id.split("id_").join("").split("_acong_").join("@");
      m.onclick=async()=>{await clickUser(v);};
    });
  }
}
async function clickUser(v){
  showChatInput();
  chatListenSend();
  window.sendto_T_=v; 
  soc.send_T_data.filter(n=>{
    if(n.userId==v&&n.data.type=="data"){n.view=1}
  });
  soc.send_T_data=soc.send_T_data;
  tfl.cookie(tfl.cookie("userT")+"_data",soc.send_T_data);
  if(window.chat_with){chat_with.innerHTML=v}
  send_T_list.classList.add("dn");
  send_T_his.classList.remove('dn');
  chat_ls1.classList.remove('dn');
  chat_with.classList.remove('dn');
  //console.log(v);
  window.send_T_.setAttribute("placeholder","Chat with "+v);
  //soc.userActive();
  send_T_his.innerHTML=`<div id="his_loading">Loading...</div>`
  await loadHistory(v);
  if(document.querySelector("#his_loading")){document.querySelector("#his_loading").remove();}
  send_T_his.scrollTo({ top: 1000000, behavior: 'smooth', });
  chat_ls1.onclick=async()=>{
    showChatMenu();
    send_T_list.classList.remove("dn");
    send_T_his.classList.add('dn');
    chat_ls1.classList.add('dn');
    chat_with.classList.add('dn');

    document.querySelectorAll("#send_T_box svg").forEach(m=>{
      let n=m.parentNode;
      n.classList.remove("f-orange");
      n.classList.add("f-gray");
    });

    if(!window.chatMenu&&document.querySelector("#send_T_box .icon_globe")){
      await soc.onlines();
      document.querySelector("#send_T_box .icon_globe").classList.add("f-orange");
      document.querySelector("#send_T_box .icon_globe").classList.remove("f-gray");
    }

    if(window.chatMenu=="friends"&&document.querySelector("#send_T_box .icon_group")){
      await soc.chatFriends();
      document.querySelector("#send_T_box .icon_group").classList.add("f-orange");
      document.querySelector("#send_T_box .icon_group").classList.remove("f-gray");
    }
    
    if(window.chatMenu=="history"&&document.querySelector("#send_T_box .icon_history")){
      await soc.chatHistory();
      document.querySelector("#send_T_box .icon_history").classList.add("f-orange");
      document.querySelector("#send_T_box .icon_history").classList.remove("f-gray");
    }

  }
}
function chatListenSend(){
  if(document.querySelector("#send_T_")){
    document.querySelector("#send_T_").addEventListener("keyup",()=>{
      if(window.sendto_T_){
        soc.typing(window.sendto_T_,window.userT,document.querySelector("#send_T_").value.trim());
        let v= event?event.which:{};
        if((v==13)||!event){document.querySelector("#send_T_btn").click();}
      }
    });

    document.querySelector("#send_T_btn").addEventListener("click",()=>{
      if(window.sendto_T_&&document.querySelector("#send_T_").value){
        soc.userActive();
        soc.send(sendto_T_,document.querySelector("#send_T_").value.trim());
        document.querySelector("#send_T_").value="";
      }else{document.querySelector("#send_T_").focus()}
    });
  }
}
function showChatMenu(){
  //if(tfl.cookie("user.user")!="datnv6"){return}
  send_T_box.innerHTML=`
  <div class="w100 df aic jcsb bg-light">
        <div><div onclick="soc.onlines()" class="ps20 ms10 me10 wh23 icon_globe f-orange"></div></div>
        <div><div onclick="soc.chatFriends()"class="ms10 me10 wh23 icon_group f-gray"></div></div>
        <div><div onclick="soc.chatHistory()" class="ms10 me10 wh23 icon_history f-gray"></div></div>
        <div><div class="ms10 me10 wh23 icon_menu2 f-gray pe20"></div></div>
  </div>
     `;
  icon_init();
}
function showChatInput(){
  send_T_box.innerHTML=`
          	<div class="df aic ps20">
            	<div onclick="soc.emoji('',0,10,1)" class="m5 cp df">🤔</div>
                <div onclick="soc.sendPeer()" class="m5 cp df">📎</div>
      		</div>
          	<input id="send_T_" type="Text" class="p5 m5 bd bdr5 w100 df"/>
            <div class="df aic pe20"><div class="p10 cp df" id="send_T_btn">Send</div></div>
     `;
}
async function loadHistory(user){

  let t=await soc.getChatHis(user);
  t=Object.values(t).flat();
  t.filter(m=>m.tid=m.data.data.id);
  await db("chat").add(t);
  //console.log(user,t);
  t.sort((a,b)=>(a.time>b.time?1:-1));
  send_T_his.innerHTML="";
  let d=t;
  for(let i=0;i<d.length;i++){
    appendD(d[i],1);
  }
}
async function appendD(t,off) {
  if(!off){
    soc.received(t.userId, t.data.data.id);
    //soc.send_T_data.push(t);
    //tfl.cookie(window.userT + "_data", soc.send_T_data);
  }
  let div = document.createElement("div");
  div.id = t.tid;
  let fileUrl = t.data.data.fileUrl || "";
  let fn = t.data.data.fileName || "noname.txt";
  let c = t.data.data.content;
  let u = tfl.cookie("user.user");
  let us = t.userId;
  let e = document.querySelector("#id_" + t.userId);
  //console.log(u,us);
  if (e && !window.sendto_T_) {
    e.click();
    if (window.sendto_T_ && window.send_T_) {
      window.send_T_.focus()
    }
  }

  div.innerHTML = `<div class="dg col_1 pr m5 ps10 pe10">
            	<div class="fs12 ` + (t.userId == u ? `tr cg` : `color-green`) + `"><span class="user cp fwb" id="id_id_` + us + `">` + us + "</span> (" + (new Date(t.time).toLocaleString()) + `)</div>
              	<div class="w100 df"><div class="bdr5 ` + (t.userId == u ? `bdtrr0 bg-light ml-auto` : `bdtlr0 bg-main`) + ` p5 ps10 pe10 ` + (window.emoji.includes(c) ? `fs36` : `bd`) + `">` + (fileUrl ? (window.$tfl ? `<a class="cp" onclick="taiveFile('` + fn + `')">` + c + `</a>` : `<a download="` + fn + `" href="` + fileUrl + `">` + c + `</a>`) : c) + `</div></div>
                <div class="w100% df cg fs12 aic">
                	<div class="df ` + (t.userId == u ? `ml-auto` : ``) + `">
                      <div class="ms3 me3 dn">` + (new Date(t.time).toLocaleString()) + `</div>
                      <div class="danhan ms3 me3"></div>
                      <div class="taifile ms3 me3">` + (fileUrl ? (window.$tfl ? `<a class="cp" onclick="taiveFile('` + fn + `')">Tải về</a>` : `<a download="` + fn + `" href="` + fileUrl + `">Tải về</a>`) : ``) + `</div>
      </div>
      </div>
      </div>`;
  document.querySelector("#send_T_his").append(div);
  if (u && !e&&!off) {await soc.onlines();}
  //listenClickUser();
  send_T_his.scrollTo({ top: 1000000, behavior: 'smooth', });
}
async function appendD_old(t,off){
  //console.log(t);
  let div=document.createElement("div");
  div.id=t.data.data.id;
  let c=t.data.data.content;
  let u=t.data.data.user;
  let e=document.querySelector("#id_"+t.userId);
  //console.log(e,u);
  if(e&&!window.sendto_T_){e.click();if(window.sendto_T_&&window.send_T_){window.send_T_.focus()}}

  div.innerHTML=`<div class="dg col1 pr m5">
            	<div class="fs12 `+(t.userId==t.data.data.user?`tr cg`:`color-green`)+`">`+t.data.data.user+" ("+(new Date(t.time).toLocaleString())+`)</div>
              	<div class="w100 df"><div class="bdr5 `+(t.userId==u?`bdtrr0 bg-light ml-auto`:`bdtlr0 bg-main`)+` p5 ps10 pe10 `+(window.emoji.includes(c)?`fs36`:`bd`)+`">`+c+`</div></div>
                <div class="w100 df cg fs12 aic">
                	<div class="df `+(t.userId==t.data.data.user?`ml-auto`:``)+`">
                      <div class="ms3 me3 dn">`+(new Date(t.time).toLocaleString())+`</div>
                      <div class="danhan ms3 me3"></div>
      </div>
      </div>
      </div>`;
  document.querySelector("#send_T_his").append(div);
  if(u&&!e&&!off){await soc.onlines();}
  listenClickUser();
}
async function taiveFile(fn) {
  try {
    let blob = window.blob1.filter(m => m.fn == fn)[0];
    if (!window.$tfl || !blob) {
      return
    }
    let b1 = blob.blob;
    let o = new Uint8Array(b1);
    //await $tfl.fs.writeBinaryFile('path file', new Uint8Array([]));
    let pn = await $tfl.path.downloadDir() + "/" + fn;
    pn = pn.split("//").join("/");
    alert("File is downloaded to: " + pn);
    await $tfl.fs.writeBinaryFile(pn, o);
  } catch (err) {
    alert(err)
  }
}
function appendD2(t){
  if (document.querySelector("#" + t.data.data + " .danhan")) {
    document.querySelector("#" + t.data.data + " .danhan").innerHTML = "Đã nhận - " + (new Date(t.time).toLocaleString());
  }
  //document.querySelector("#"+t.data.data+" .danhan").innerHTML="Đã nhận - "+Ngay(t.time,1);
}

window.addEventListener("load",async()=>{
  chat_init();
});

async function chat_init(){
  //if(!window.userT){
  let tid=Date.now().toString(36)+(Math.floor(Math.random() * Date.now())).toString(36).padStart(8,"0");
  window.userT=(tfl.cookie("user.user")||tfl.cookie("userinfo.user")||tfl.cookie("userT")||tid);
  tfl.cookie("userT",window.userT);
  //console.log(window.userT);
  soc.user(window.userT);
  //}

  soc.send_T_data=await db("chat").find({})||[];

  setTimeout(async()=>{
    await soc.onlines();

    document.querySelector("#send_T_hide").addEventListener("click",()=>{
      let n=document.querySelector("#send_T_form");
      n.classList.add("dn");
      send_T_hide.classList.add("dn");
    });
    document.querySelector("#send_T_show").addEventListener("click",async()=>{
      let n=document.querySelector("#send_T_form");
      n.classList.remove("dn");
      send_T_hide.classList.remove("dn");
      await soc.onlines();
    });
    icon.back();

  },100);
}

function download2(blob, filename) {
  var file = new File([blob], filename);
  var url=URL.createObjectURL(file);

  const a = document.createElement('a');
  a.href = url;
  a.download = filename || 'download';
  const clickHandler = () => {
    setTimeout(() => {
      URL.revokeObjectURL(url);
      removeEventListener('click', clickHandler);
    }, 150);
  };
  a.addEventListener('click', clickHandler, false);
  a.click();
}
async function receivedFile(r) {
  window.blob1=window.blob1||[];
  window.blob1.push({blob:r.blob,fn:r.name});
  var file = new File([r.blob], r.name);
  var url=URL.createObjectURL(file);
  let ob={time:await tfl.getTime(),userId:userT, data:{data:{content:"File transfer",id:r.id,user:r.user,fileUrl:url,fileName:r.name}}};
  appendD(ob);
}
function downloadBlob(blob, name = 'file.txt') {
  if (
    window.navigator && 
    window.navigator.msSaveOrOpenBlob
  ) return window.navigator.msSaveOrOpenBlob(blob);

  // For other browsers:
  // Create a link pointing to the ObjectURL containing the blob.
  var data = window.URL.createObjectURL(blob);

  const link = document.createElement('a');
  link.href = data;
  link.download = name;

  // this is necessary as link.click() does not work on the latest firefox
  link.dispatchEvent(
    new MouseEvent('click', {bubbles: true,cancelable: true,view: window})
  );

  setTimeout(() => {
    // For Firefox it is necessary to delay revoking the ObjectURL
    window.URL.revokeObjectURL(data);
    link.remove();
  }, 100);
}

function file2base64(file){
  return new Promise(r3=>{
    let reader = new FileReader();
    reader.readAsDataURL(file);
    reader.onload = function () {
      r3(reader.result);
    };
    reader.onerror = function (error) {r3(``);};
  });
}

async function file2blob(file){
  return new Blob([new Uint8Array(await file.arrayBuffer())], {type: file.type });
}
function sendFilePeer(d,peerTo,peerToId,user){
  d.id=peerToId;
  d.user=user;
  let conn = peer.connect(peerTo);
  conn.on('open', function() {
    // Receive messages
    conn.on('data', function(data) {console.log('Received', data);});
    // Send messages
    conn.send(d);
    console.log(d);

    var file = new File([d.blob], d.name);
    var url=URL.createObjectURL(file);
    //console.log(url);
    //soc.send(sendto_T_,"File transfer",d.id,url);

    let tid=Date.now().toString(36)+(Math.floor(Math.random() * Date.now())).toString(36).padStart(8,"0");
    let time=Date.now();
    let ob={time:time, userId: user, data: {type:"data",data:{id:tid,content:"File transfer",user:user}}};
    ob.data.data.fileUrl=url;
    ob.data.data.fileName=d.name;
    appendD(ob);

  });
}
listenerT("change","#files",async(e)=>{
  for(let i=0;i<e.files.length;i++){
    let name=e.files[i].name;
    let file = e.files[i];
    //console.log(file,new Blob([file]));
    //let d={name:name,base64:await file2base64(file)};
    let d={name:name,blob:await file2blob(file),type:file.type};
    console.log("ab",d);
    sendFilePeer(d,window.peerTo,window.peerToId,window.userT);
    //await uploadT4(file,name,path,900,"");
  }
  document.querySelector("#files").value="";
});